{
  "id": "10.1007/s11357-025-02071-0",
  "title": "Aging kidney is associated with metabolic rewiring and epigenetic reprogramming.",
  "abstract": "Understanding the direct connections between metabolism and chromatin dynamics may uncover potential mechanisms involved in the aging process of renal physiology. Despite known differences in incidence and aging renal disease, how biological aging intersects with renal metabolism and epigenetics in a sex-specific context remains poorly understood. Here, we determined the effect of age on renal metabolic pathways and metabolite cofactors of epigenetic modifiers in a sex-specific manner. We measured metabolites in kidney homogenates from young and aged mice by HPLC-TripleTOF (LC-MS). The major metabolic adaptations observed with aging include increased glycolysis, decreased fatty acid oxidation, mitochondrial dysfunction, oxidative stress, and impaired metabolic waste clearance in 24-month-old (aged) mice compared to 4-month-old (young) sex-matched mice. Additionally, we found elevated levels of methylation and acetylation of intermediate metabolites also known as 'epimetabolites' in aged mice. Furthermore, age-related alterations were detected in metabolites (acetyl-coenzyme A, flavin adenine dinucleotide, and &#x3b1;-ketoglutarate) that are essential cofactors for the activities of epigenetic enzymes. Sex-specific changes were observed with age such as, significantly enhanced amino acid catabolism and tryptophan metabolism and reduced lysophospholipase activity and ammonia clearance in aged female vs aged male mice. Our results reveal age- and sex-associated alterations in renal metabolic pathways, characterized by an increase in epigenetically modified intermediate metabolites with aging. These findings suggest a complex interplay between renal metabolomics and epigenetics and offer new insights into the mechanisms underlying sex-specific renal physiology of aging kidneys.",
  "journal": "GeroScience",
  "doi": "10.1007/s11357-025-02071-0",
  "url": "https://doi.org/10.1007/s11357-025-02071-0",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T08:34:19.907Z"
}