{
  "id": "10.3390/ijms27010108",
  "title": "Current Controversies on Adequate Circulating Vitamin D Levels in CKD.",
  "abstract": "Management of secondary hyperparathyroidism (SHPT) in chronic kidney disease (CKD) has evolved dramatically over the past five decades, driven by discoveries that have fundamentally reshaped our understanding of the vitamin D endocrine system and its role in disease progression. This review synthesizes the key pathophysiological insights and clinical evidence underlying three critical paradigm shifts. The first shift moved beyond simple calcitriol replacement with the development of selective vitamin D receptor activators (VDRAs) designed to minimize hypercalcemia while maximizing PTH suppression. Crucially, these analogs revealed unexpected survival benefits, suggesting protective VDR actions extending beyond mineral metabolism. The second shift recognized the profound prevalence and independent mortality risk associated with nutritional vitamin D (25(OH)D) deficiency in CKD. This highlighted the kidney's complex role in maintaining systemic 25(OH)D supply and the importance of extrarenal vitamin D activation, although optimal assessment, targets, and supplementation strategies remain highly controversial due to CKD-specific pathophysiology (e.g., megalin loss, impaired uptake, obesity effects) and complex dosing paradoxes. The third, and most impactful, shift centers on the FGF23-Klotho axis. Pathologically high FGF23 is now established as a direct cardiovascular and skeletal toxin, acting via Klotho-independent pathways in CKD, while the profound deficiency of the protective, anti-aging hormone Klotho exacerbates systemic damage (inflammation, oxidative stress, impaired autophagy). This creates a major therapeutic dilemma, as VDRAs induce protective Klotho but worsen toxic FGF23, while calcimimetics do not increase FGF23 but offer no Klotho benefit. Furthermore, this complex interplay is obscured by significant limitations in accurately measuring FGF23 isoforms, soluble Klotho, and true vitamin D status. These paradigm shifts reveal a complex pathophysiology far beyond simple PTH control, demanding a move towards nuanced, potentially combined therapeutic strategies that balance FGF23 burden with Klotho preservation. Overcoming the profound diagnostic limitations to accurately monitor this axis and guide personalized therapy represents the critical next frontier in improving outcomes for patients with CKD.",
  "journal": "International journal of molecular sciences",
  "doi": "10.3390/ijms27010108",
  "url": "https://doi.org/10.3390/ijms27010108",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T08:34:19.902Z"
}