{
  "id": "10.1016/j.arr.2026.103029",
  "title": "Evaluating Senescence-Targeted Approaches in Alzheimer's Disease: What We Know and What Lies Ahead.",
  "abstract": "Alzheimer's disease (AD) is a progressive and irreversible neurodegenerative disease, which represents the most prevalent dementia worldwide. Although amyloid-&#x3b2; (A&#x3b2;) and tau pathology have been the classic focus of treatment, accumulating evidence indicates that ageing-associated cellular senescence plays a central role in AD pathogenesis. Senescent neurons, astrocytes, microglia and endothelial cells accumulate in the ageing and Alzheimer's brain and adopt a senescence-associated secretory phenotype characterized by sustained release of pro-inflammatory and neurotoxic factors. This chronic inflammatory milieu promotes neurodegeneration, disrupts the synaptic activity and is involved in cognitive deficit. Senolytics, which selectively eliminate senescent cells, have demonstrated benefit in multiple preclinical models of AD, including decreased neuroinflammation, improvement in neuronal function and cognitive performance. Several senolytic agents, such as dasatinib, quercetin, fisetin and navitoclax, hit anti-apoptotic modalities that support the survival of senescent cells. Early-phase human studies suggest the feasibility of senescence-targeted interventions and indicate that senescence-associated molecular changes may compromise blood-brain barrier integrity. Consistently, preclinical studies demonstrate partial restoration of barrier function following senolytic therapy; however, clinical translation remains limited and at an early stage. Major challenges include the identification of senolytic agents with effective central nervous system penetration, the determination of optimal dosing regimens and treatment schedules, generation of robust long-term safety profile in human population, and the development of predictive biomarkers to guide patient selection and clinical study design. As senolytics and senomorphic strategies continue to evolve, they hold promise as complementary approaches to existing anti-amyloid and anti-tau therapies by offering a multi-mechanistic approach toward AD modification. This review synthesizes current evidence on cellular senescence in AD, outlines the mechanistic rationale for senescence-targeted therapies, summarizes available clinical data, while providing future directions for integrating senolytics into AD management.",
  "journal": "Ageing research reviews",
  "doi": "10.1016/j.arr.2026.103029",
  "url": "https://doi.org/10.1016/j.arr.2026.103029",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T18:01:03.748Z"
}