{
  "id": "10.1016/j.ejphar.2026.178620",
  "title": "Natural senotherapeutics in respiratory health: Addressing cellular senescence, inflammaging, and immunosenescence in the aging lung.",
  "abstract": "Aging is a major risk factor for respiratory diseases, with the respiratory system demonstrating a particular vulnerability to age-related decline. This review explores the intersection between aging biology and respiratory pathophysiology, focusing on three interconnected hallmarks: cellular senescence, inflammaging, and immunosenescence. Senescent cells accumulate in aging lungs, releasing a senescence-associated secretory phenotype (SASP) that perpetuates chronic inflammation and tissue dysfunction. Natural Senotherapeutics, compounds that target senescent cells or modulate their effects, offer promising strategies to address these fundamental mechanisms. We examined the latest findings on key natural compounds (rapamycin, berberine, resveratrol, pterostilbene, quercetin, EGCG, fisetin, apigenin and curcumin) that demonstrate senomorphic and/or senolytic properties in respiratory contexts. These compounds function through diverse but overlapping molecular pathways, mainly modulating inflammation, immune dysfunction and oxidative stress. Preclinical evidence consistently supports their potential in models of chronic obstructive pulmonary disease (COPD), idiopathic pulmonary fibrosis (IPF), acute respiratory distress syndrome (ARDS), and respiratory infections, although their clinical translation remains limited. The challenges include bioavailability, optimal dosing regimens, and delivery methods. As global demographics shift toward an aging population, developing interventions that target fundamental aging mechanisms in the respiratory system is becoming increasingly urgent. Natural senotherapeutics may offer a paradigm shift in maintaining respiratory health in older adults, with potentially fewer adverse effects than synthetic alternatives.",
  "journal": "European journal of pharmacology",
  "doi": "10.1016/j.ejphar.2026.178620",
  "url": "https://doi.org/10.1016/j.ejphar.2026.178620",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T08:34:19.904Z"
}