{
  "id": "10.1007/s00726-026-03497-2",
  "title": "Polyamine metabolism as a regulator of cellular and organismal aging.",
  "abstract": "Polyamines - putrescine, spermidine, and spermine - are ubiquitous cationic molecules that are essential for cellular proliferation and homeostasis. Their intracellular concentrations decline with age, contributing to physiological and cognitive deterioration. Recent studies have revealed that spermidine supplementation extends lifespan and improves cognitive and cardiac function in various model organisms, suggesting that maintaining polyamine balance has anti-aging potential. Polyamine metabolism is tightly regulated through biosynthesis, degradation, and transport; however, age-associated upregulation of spermine oxidase (SMOX) and accumulation of its toxic byproduct acrolein promote oxidative damage and cellular senescence. Suppressing SMOX activity or polyamine degradation attenuates senescence markers and DNA damage, highlighting spermine catabolism as a therapeutic target. Polyamines also modulate epigenetic regulation, including DNA methylation and histone acetylation, thereby influencing gene expression and chromatin structure during aging. Moreover, polyamine-dependent hypusination of eIF5A sustains protein synthesis in senescent cells. These multifaceted actions indicate that polyamine metabolism integrates redox control, translational regulation, epigenetic maintenance and autophagy to determine cellular and organismal longevity. While animal studies demonstrate clear anti-aging effects of spermidine and spermine, human clinical evidence remains limited, with variable outcomes likely due to bioavailability and metabolic conversion. Future strategies combining dietary or probiotic polyamine enhancement, enzyme-targeted inhibitors, and personalized metabolic interventions hold promise for extending healthspan. Collectively, maintaining optimal polyamine homeostasis emerges as a key approach to counteract aging and age-related diseases.",
  "journal": "Amino acids",
  "doi": "10.1007/s00726-026-03497-2",
  "url": "https://doi.org/10.1007/s00726-026-03497-2",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T18:01:03.739Z"
}