{
  "id": "10.1038/s41598-025-32797-y",
  "title": "Protection of multiple aspects of Alzheimer's disease pathology using dietary supplementation with taurine.",
  "abstract": "As Alzheimer&#x2019;s disease (AD) continues to rise amongst the aging population, preventative measures such as dietary or lifestyle changes represent an attractive option to mitigate the burden. Taurine, known for its antioxidant and anti-inflammatory properties, may also play a neuroprotective role. This study investigates the protective effects of taurine supplementation in 5xFAD mice. Taurine was administered through drinking water at doses of 0, 500, 1000, 2000, 4000&#xa0;mg/kg/day, with no change in water consumption or body mass was observed. Postmortem markers of neuroinflammation using cytokine profiling demonstrated that 2000&#xa0;mg/kg/day was effective at invoking a protective response against AD progression. An acute dose of this concentration, in older mice, was also sufficient at protecting the dentate gyrus against gliosis and preventing volume loss. Supplementation of taurine for 1&#x2013;2 months in older mice also led to a small reduction in the A&#x3b2;42 burden. This suggests that in pre-clinical models of AD, both long-term and acute administration of taurine can mitigate pathological AD characteristics. High-resolution magic angle spinning magnetic resonance spectroscopy (HRMAS-MRS) was used to analyze and differentiate the molecular profile of 3 key AD-affected regions: frontal cortex, ventral and dorsal hippocampus. Significant changes in 5 metabolites (GABA, glutamate, NAA, aspartate and scyllo-inositol) were observed in AD at two different ages (3&#x2013;4 months and 8 months). Taurine supplementation changed the values of a number of metabolites, including NAA and glutamate, to levels closer to that of the wild-type mice, suggesting neuroprotection of these metabolites. Overall, these findings support dietary taurine supplementation as a promising preventative strategy for AD.",
  "journal": "Scientific reports",
  "doi": "10.1038/s41598-025-32797-y",
  "url": "https://doi.org/10.1038/s41598-025-32797-y",
  "publishedDate": "2026",
  "studyType": "animal",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T18:01:03.749Z"
}