{
  "id": "10.1007/s11427-024-3060-0",
  "title": "Targeting senescent cells in aged adipose tissue induced by ovarian cancer with the NF-&#x3ba;B inhibitor quercetin and resveratrol impedes the growth and metastasis of ovarian cancer.",
  "abstract": "As a lipophilic tumour, ovarian cancer (OC) preferentially metastasizes to adipose-rich environments including the omentum and the peritoneum. Current research regarding the OC microenvironment has focused primarily on tumour-associated immune cells, whereas little attention has been given to the adipose tissue and the adipose-derived stem cells (ADSCs) within it. Here, from the perspective of senescence, we hypothesized that the continuous presence and accumulation of tumour cells disrupts the homeostasis of adipose tissue by intercellular interactions. Through a series of in vitro and in vivo experiments, we found that OC cells induce adipose tissue ageing and ADSC senescence, leading to adipose tissue dysfunction, glucose intolerance, and insulin resistance. OC extracellular vesicle (OC-EV) and ADSC coculture revealed that OC-EVs trigger ADSC ageing and dysfunction. Moreover, coculture promoted the formation of inflammasomes in ADSCs and increased the levels of the inflammatory factors IL-1&#x3b2; and IL-18. RNA-sequencing and bioinformatics analysis revealed that the nuclear factor kappa B (NF-&#x3ba;B) signalling pathway is involved in ADSC senescence induced by OC cells. Immunofluorescence staining and Western blotting confirmed that increased expression of NF-&#x3ba;B signalling-related proteins is associated with senescent ADSCs. Further mechanistic studies revealed that OC-EVs deliver IL-1&#x3b2; to promote ADSC senescence and regulate the NF-&#x3ba;B signalling pathway in ADSCs. On the basis of these findings, we attempted to ameliorate the ovarian cancer microenvironment by eliminating senescent ADSCs, aiming to develop a therapeutic strategy against ovarian cancer. Both treatment with the senolytic cocktail dasatinib plus quercetin and treatment with the NF-&#x3ba;B inhibitor resveratrol (RSV) alleviated adipose tissue ageing, improved glucose tolerance and insulin sensitivity, and ultimately decreased OC progression and metastasis. Together, these results indicate an important role of ovarian cancer in adipose tissue ageing, and identify the elimination of senescent ADSCs in adipose tissue as a new potential strategy for the treatment of OC.",
  "journal": "Science China. Life sciences",
  "doi": "10.1007/s11427-024-3060-0",
  "url": "https://doi.org/10.1007/s11427-024-3060-0",
  "publishedDate": "2026",
  "studyType": "in-vitro",
  "tags": [
    "pubmed",
    "longevity"
  ],
  "authors": [],
  "indexedAt": "2026-02-04T08:34:19.893Z"
}