{
  "id": "10.1101/2024.09.09.611977",
  "title": "The heat is on: behavioural, physiological and reproductive evidence of heat stress in breeding king penguins.",
  "authors": [
    "Noiret, A.",
    "Lewden, A.",
    "Lemonnier, C.",
    "Bocquet, C.",
    "Montblanc, M.",
    "Bertile, F.",
    "Hoareau, M.",
    "Marcon, E.",
    "Robin, J.-P.",
    "Viblanc, V. A.",
    "Stier, A."
  ],
  "journal": "bioRxiv (preprint)",
  "publishedDate": "2026-02-04",
  "doi": "10.1101/2024.09.09.611977",
  "url": "https://doi.org/10.1101/2024.09.09.611977",
  "abstract": "Polar and sub-polar animals evolved to thrive in cold climates and may thus be particularly vulnerable to rising temperatures associated with climate change. Penguins may be especially vulnerable due to their dual habitat, alternating between foraging in cold waters and breeding/moulting on an increasingly warm land. Here, we characterized heat stress occurrence in breeding king penguins through behavioural observations (e.g. panting occurrence) and body temperature measurements. We observed that behavioural signs of heat stress are frequent in king penguins breeding in the sub-Antarctic region (> 20% of observations at mid-day), and that subcutaneous temperatures increase under high heat load, especially in penguins showing behavioural signs of heat stress. Subcutaneous and core body temperatures were moderately correlated and both increased with heat load. Yet, their responses were not parallel since core body temperature is markedly less sensitive to heat load than subcutaneous temperature. Air temperature alone was a poor predictor of heat stress occurrence, whereas the combination of high solar radiation, low wind speed and high air temperatures provided the strongest predictive power. Finally, reproductive failures were more likely to occur on warmer days, suggesting that heat stress may have significant sublethal effects that could ultimately affect population dynamics.",
  "studyType": "preprint",
  "tags": [
    "preprint",
    "longevity"
  ],
  "indexedAt": "2026-02-04T18:01:03.753Z"
}